notebook/blog-2007-11-14-0023.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>The Future of GNU Emacs</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-08-02 19:51:54 EDT"/>
<meta name="author" content="David O'Toole"/>
<meta name="description" content="The Future of GNU Emacs"/>
<meta name="keywords" content=""/>
<link rel='stylesheet' href="/eon.css" type="text/css"/><link href='http://fonts.googleapis.com/css?family=Ubuntu:regular,italic,bold' rel='stylesheet' type='text/css'/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">The Future of GNU Emacs</h1>

<p>I started a discussion page on the Emacswiki:
<a href="http://www.emacswiki.org/cgi-bin/wiki/TheFutureOfGnuEmacs">http://www.emacswiki.org/cgi-bin/wiki/TheFutureOfGnuEmacs</a>
</p>
<p>
It'll be obliterated with edits soon I hope :-), so here is the
original text I posted as a starting point for the discussion:
</p>

<div id="outline-container-1" class="outline-3">
<h3 id="sec-1">Don't rewrite or fork GNU Emacs </h3>
<div class="outline-text-3" id="text-1">


<p>
GNU Emacs is basically the Right Thing, and we just need to keep
improving it and adding new stuff. A fork would be a disaster, because
we are trying to unify the Emacsverse.  
</p>
</div>

</div>

<div id="outline-container-2" class="outline-3">
<h3 id="sec-2">Standardize on GNU Emacs 22.x </h3>
<div class="outline-text-3" id="text-2">


<p>
There is no point in trying to support any other flavor of Emacs than
GNU Emacs 22-and-up, especially if we want to take advantage of all
the new stuff (multitty, network servers, etc.) I want a single target
platform, not the Java-esque “if I’m in xemacs, do such-and-such…”
</p>
</div>

</div>

<div id="outline-container-3" class="outline-3">
<h3 id="sec-3">We are stuck with Emacs Lisp </h3>
<div class="outline-text-3" id="text-3">


<p>
It has a three-decades-deep archive of working code, and a thriving
development community today, so it isn’t going anywhere. My solution
is 1. develop workarounds for, and raise awareness of, what exactly
these awful problems supposedly are with Emacs Lisp, and 2. promote
cl.el and object-orientation.  
</p>
</div>

</div>

<div id="outline-container-4" class="outline-3">
<h3 id="sec-4">The CL policy sucks </h3>
<div class="outline-text-3" id="text-4">


<p>
We all know about this one.  
</p>
</div>

</div>

<div id="outline-container-5" class="outline-3">
<h3 id="sec-5">We should push Emacs to its limits </h3>
<div class="outline-text-3" id="text-5">


<p>
The problems we encounter will point the way to (and show the need
for) changes in Emacs itself.  
</p>
</div>

</div>

<div id="outline-container-6" class="outline-3">
<h3 id="sec-6">Miscellaneous </h3>
<div class="outline-text-3" id="text-6">


<p>
I want ELPA to integrate with the Debian packaging system somehow
</p>
<p>
We need to improve the display engine. There was something in the Emacs TODO about emacs being able to absorb an X window within one of its windows.
</p></div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2011-08-02 19:51:54 EDT</p>
<p class="author">Author: David O'Toole</p>
<p class="creator">Org version 7.7 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
